Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FixedFabricationPartNotChangeLength Property
 Failed to change length of fixed part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FixedFabricationPartNotChangeLength { get; }
Public Shared ReadOnly Property FixedFabricationPartNotChangeLength As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FixedFabricationPartNotChangeLength {
	FailureDefinitionId^ get ();
}
static member FixedFabricationPartNotChangeLength : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace